Autodesk.Revit.DB.BuiltInFailures.ScaleFailures.CannotScaleLinkWithSharedCoordinates
Can't scale link that shares coordinates with host model

Autodesk.Revit.DB.BuiltInFailures.ScaleFailures
Failures about Scale.